Import libraries and database username and password info

In [1]:
import pandas as pd
import pymysql
import os
from flask_sqlalchemy import SQLAlchemy
from sqlalchemy import create_engine
from UI.config import username, password

Connect to the database

In [2]:
engine = create_engine(f'mysql+pymysql://{username}:{password}@localhost/traktor_tek_db')

Read the CSV files with the historical data information into panda dataframes

In [3]:
os.chdir('D:\\Training\\DA_Bootcamp\\UNIT 1 Foundation\\Capstone_1\\Capstone_Files\\historical_data')
prod_df=pd.read_csv('product.csv')
sales_df=pd.read_csv('sales.csv')
sales_period_df=pd.read_csv('sales_period.csv')
sales_team_df=pd.read_csv('sales_team.csv')

Load the dataframes into the database tables

In [7]:
sales_team_df.to_sql('sales_team',engine,if_exists='append',index=False)

In [ ]:
Read the database tables back into dataframes

In [8]:
sales_team_df = pd.read_sql_table('sales_team',engine)

Check the first five rows of each table to make sure things loaded properly

In [9]:
sales_team_df.head()

   emp_id         team_lead paygrade region
0  EMP234    Bachmann, Jane      C13     NW
1  EMP244       Evans, Gina      C12     NW
2  EMP256     Lawson, Harry      C11     NW
3  EMP267  Clement, Beverly      C14     SW
4  EMP290      Allen, Maude      C12     SW